Revit 2027 API
FillPattern(String, FillPatternTarget, FillPatternHostOrientation, Double, Double) Constructor
 Creates a simple hatch fill pattern based on the given name, angle, spacing, FillPatternTarget and FillPatternHostOrientation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FillPattern(
	string name,
	FillPatternTarget target,
	FillPatternHostOrientation orientation,
	double angle,
	double spacing1
)
Public Sub New (
	name As String,
	target As FillPatternTarget,
	orientation As FillPatternHostOrientation,
	angle As Double,
	spacing1 As Double
)
public:
FillPattern(
	String^ name,
	FillPatternTarget target,
	FillPatternHostOrientation orientation,
	double angle,
	double spacing1
)
new :
        name : string *
        target : FillPatternTarget *
        orientation : FillPatternHostOrientation *
        angle : float *
        spacing1 : float -> FillPattern
Parameters
name String
 The name.
target FillPatternTarget
 The fill pattern target.
orientation FillPatternHostOrientation
 The fill pattern orientation.
angle Double
 The angle.
spacing1 Double
 The spacing.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
FillPattern Class
FillPattern Overload
Autodesk.Revit.DB Namespace